Res-Latency-social1/Res-container-random-v1/container_t_10_c_30_composePosts_composeCore_4_wrkCore_1_R_800/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 4.352ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.292ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.204ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.237ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.329ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.343ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.298ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.367ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.398ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.432ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.26ms    1.25ms   8.91ms   82.82%
    Req/Sec    83.16     88.61   363.00     78.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.99ms
 75.000%    4.62ms
 90.000%    5.59ms
 99.000%    8.91ms
 99.900%   13.12ms
 99.990%   20.19ms
 99.999%   26.86ms
100.000%   26.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.805     0.000000            1         1.00
       3.149     0.100000         3983         1.11
       3.415     0.200000         7955         1.25
       3.615     0.300000        11973         1.43
       3.805     0.400000        15927         1.67
       3.991     0.500000        19888         2.00
       4.091     0.550000        21870         2.22
       4.203     0.600000        23885         2.50
       4.327     0.650000        25898         2.86
       4.463     0.700000        27863         3.33
       4.623     0.750000        29853         4.00
       4.719     0.775000        30827         4.44
       4.831     0.800000        31832         5.00
       4.959     0.825000        32826         5.71
       5.107     0.850000        33809         6.67
       5.315     0.875000        34798         8.00
       5.451     0.887500        35297         8.89
       5.591     0.900000        35793        10.00
       5.767     0.912500        36283        11.43
       5.995     0.925000        36784        13.33
       6.287     0.937500        37278        16.00
       6.447     0.943750        37526        17.78
       6.643     0.950000        37775        20.00
       6.851     0.956250        38025        22.86
       7.071     0.962500        38277        26.67
       7.323     0.968750        38519        32.00
       7.471     0.971875        38643        35.56
       7.639     0.975000        38770        40.00
       7.847     0.978125        38896        45.71
       8.055     0.981250        39018        53.33
       8.295     0.984375        39141        64.00
       8.431     0.985938        39203        71.11
       8.607     0.987500        39267        80.00
       8.783     0.989062        39327        91.43
       8.999     0.990625        39390       106.67
       9.239     0.992188        39451       128.00
       9.375     0.992969        39484       142.22
       9.543     0.993750        39513       160.00
       9.807     0.994531        39545       182.86
      10.031     0.995313        39577       213.33
      10.319     0.996094        39606       256.00
      10.567     0.996484        39622       284.44
      10.935     0.996875        39637       320.00
      11.207     0.997266        39653       365.71
      11.391     0.997656        39668       426.67
      11.743     0.998047        39684       512.00
      11.991     0.998242        39692       568.89
      12.327     0.998437        39699       640.00
      12.583     0.998633        39708       731.43
      12.927     0.998828        39715       853.33
      13.239     0.999023        39723      1024.00
      13.399     0.999121        39727      1137.78
      13.783     0.999219        39730      1280.00
      14.007     0.999316        39734      1462.86
      14.543     0.999414        39738      1706.67
      15.087     0.999512        39742      2048.00
      15.399     0.999561        39744      2275.56
      15.695     0.999609        39746      2560.00
      15.807     0.999658        39748      2925.71
      16.399     0.999707        39750      3413.33
      16.735     0.999756        39752      4096.00
      17.391     0.999780        39753      4551.11
      17.439     0.999805        39754      5120.00
      18.063     0.999829        39755      5851.43
      19.855     0.999854        39756      6826.67
      20.191     0.999878        39757      8192.00
      20.191     0.999890        39757      9102.22
      22.447     0.999902        39758     10240.00
      22.447     0.999915        39758     11702.86
      22.543     0.999927        39759     13653.33
      22.543     0.999939        39759     16384.00
      22.543     0.999945        39759     18204.44
      24.671     0.999951        39760     20480.00
      24.671     0.999957        39760     23405.71
      24.671     0.999963        39760     27306.67
      24.671     0.999969        39760     32768.00
      24.671     0.999973        39760     36408.89
      26.863     0.999976        39761     40960.00
      26.863     1.000000        39761          inf
#[Mean    =        4.259, StdDeviation   =        1.247]
#[Max     =       26.848, Total count    =        39761]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47749 requests in 1.00m, 9.79MB read
Requests/sec:    795.69
Transfer/sec:    167.06KB